In [1]:
import pandas as pd
from datetime import datetime
from IPython.display import display
import warnings
warnings.filterwarnings("ignore")

Intel MKL WARNING: Support of Intel(R) Streaming SIMD Extensions 4.2 (Intel(R) SSE4.2) enabled only processors has been deprecated. Intel oneAPI Math Kernel Library 2025.0 will require Intel(R) Advanced Vector Extensions (Intel(R) AVX) instructions.
Intel MKL WARNING: Support of Intel(R) Streaming SIMD Extensions 4.2 (Intel(R) SSE4.2) enabled only processors has been deprecated. Intel oneAPI Math Kernel Library 2025.0 will require Intel(R) Advanced Vector Extensions (Intel(R) AVX) instructions.

In [2]:
from spendings import MoneySpendings

In [3]:
df = pd.read_csv("Spendings_csv.csv", parse_dates=["Date"], date_format="%d/%m/%Y")

In [4]:
test = MoneySpendings(df)

In [6]:
test.info_by_month(year=2024, month=3)

Spendings in March 2024: 10324.73 sheckels
Spendings in March 2024 with the appartment: 16024.73 sheckels

                 Price  Count
Category
Home           3812.95     11
Grocery        1877.10     15
Restaurants    1266.00     10
Health         1165.50      8
Fuel            671.73      3
Treatment       577.17      4
Presents        551.70      2
Utility bills   261.58      2
Parking         141.00      3

         Price  Price_apt
Who
Pasha  7267.83   10117.83
Alona  3056.90    5906.90

In [7]:
test.annual_report(year=2024)

Annual report 2024

               January  February  March  April   May  June  July
Auto                 0         0      0    169     0    20     0
Beauty             853       230      0    420  1541   480  1150
Clothes              0       150      0    587     0     0     0
Education           34         0      0    175   254    71     0
Entertainment        0         0      0      0   630  1300     0
Fuel              1282      1315    672    947   573   840   568
Goverment            0         0      0    270     0     0   130
Grocery           2312      2415   1877   2367  2790  2805  2750
Health            3192      3019   1166   1133   372  2725  3313
Home               313      4463   3813    225   803  1231   867
Other                0         0      0     16     0     0     0
Parking             87       193    141    172    31   209   129
Presents           519      1010    552    250  3258   956   275
Restaurants        167       608   1266   1452  1052   865   730
SuperPharm           0       177      0     96     0     0     0
Treatment          498       404    577    562   574   491   349
Utility bills      178       882    262    680   553    94   953

                  Price  Price_apt
Month    Name
January  Pasha  6122.27    8972.27
         Alona  3313.50    6163.50
February Pasha  8902.01   11752.01
         Alona  5963.28    8813.28
March    Pasha  7267.83   10117.83
         Alona  3056.90    5906.90
April    Pasha  6004.36    8854.36
         Alona  3516.10    6366.10
May      Pasha  8439.73   11289.73
         Alona  3991.76    6841.76
June     Pasha  5950.43    8800.43
         Alona  6137.35    8987.35
July     Pasha  5899.84    8749.84
         Alona  5313.70    8163.70

In [9]:
test.info_by_period(date_beg="09/02/2024", date_end="17/03/2024")

Spendings in 09/02/2024 - 17/03/2024: 19077.11 sheckels
Spendings in 09/02/2024 - 17/03/2024 with the appartment: 24777.11 sheckels

                 Price  Count
Category
Home           7393.05     15
Health         2906.35     17
Grocery        2616.02     20
Restaurants    1614.80     15
Fuel           1256.72      5
Presents       1007.00      6
Utility bills   881.86      4
Treatment       789.61      7
Parking         285.00      5
SuperPharm      176.70      3
Beauty          150.00      1

          Price  Price_apt
Who
Pasha  11375.93   14225.93
Alona   7701.18   10551.18

In [10]:
test.info_by_year(2024)

Spendings in 2024: 79879.06 sheckels
Spendings in 2024 with the appartment: 119779.06 sheckels

                  Price  Count
Category
Grocery        17316.01    149
Health         14920.35     77
Home           11715.23     60
Presents        6819.40     28
Fuel            6196.45     25
Restaurants     6139.20     66
Beauty          4674.00     20
Utility bills   3602.06     23
Treatment       3455.76     40
Entertainment   1930.00      7
Parking          962.00     22
Clothes          737.00      3
Education        534.00      7
Goverment        400.00      2
SuperPharm       272.60      4
Auto             189.00      3
Other             16.00      1

          Price  Price_apt
Who
Pasha  48586.47   68536.47
Alona  31292.59   51242.59